import React, { useState } from 'react';
import styles from '../styles/styles.module.scss';
import 三月七 from '../components/三月七';

const 计算伤害 = ({
	面板攻击力,
	伤害提高,
	暴击率,
	暴击伤害,
	怪物抗性,
	减抗,
	人物等级,
	怪物等级,
	减防百分比,
	易伤,
	韧性减伤,
	速度,
	技能倍率,
}) => {
	const 敌方防御力 = (怪物等级 + 20) * (1 - 减防百分比 / 100);
	const 防御力减伤 = 敌方防御力 / (敌方防御力 + 人物等级 + 20);
	const 抗性减伤 = (怪物抗性 - 减抗) / 100;
	const 不暴击伤害 =
		面板攻击力 *
		(1 + 伤害提高 / 100) *
		(1 - 抗性减伤) *
		(1 - 防御力减伤) *
		(1 + 易伤 / 100) *
		(1 - 韧性减伤 / 100) *
		(技能倍率 / 100);
	const 暴击时伤害 = 不暴击伤害 * (1 + 暴击伤害 / 100);
	const 暴击伤害期望 = 不暴击伤害 * (1 - 暴击率 / 100) + (暴击时伤害 * 暴击率) / 100;
	const 轮均期待伤害 = 暴击伤害期望 * (速度 / 100);
	return {
		暴击时伤害,
		暴击伤害期望,
		轮均期待伤害,
	};
};

const 计算提升 = (提升后, 原本) => ((提升后 / 原本 - 1) * 100).toFixed(2);

export default function 伤害计算页面() {
	const [基础攻击力, 设置基础攻击力] = useState(1200);
	const [面板攻击力, 设置面板攻击力] = useState(3000);
	const [伤害提高, 设置伤害提高] = useState(48.8);
	const [暴击率, 设置暴击率] = useState(70);
	const [暴击伤害, 设置暴击伤害] = useState(140);
	const [怪物抗性, 设置怪物抗性] = useState(20);
	const [减抗, 设置减抗] = useState(0);
	const [怪物等级, 设置怪物等级] = useState(80);
	const [人物等级, 设置人物等级] = useState(80);
	const [减防百分比, 设置减防百分比] = useState(0);
	const [易伤, 设置易伤] = useState(0);
	const [韧性减伤, 设置韧性减伤] = useState(10);
	const [速度, 设置速度] = useState(134);
	const [技能倍率, 设置技能倍率] = useState(200);

	const 单人数值 = {
		面板攻击力,
		伤害提高,
		暴击率,
		暴击伤害,
		怪物抗性,
		减抗,
		人物等级,
		怪物等级,
		减防百分比,
		易伤,
		韧性减伤,
		速度,
		技能倍率,
	};

	const 单人伤害 = 计算伤害(单人数值);

	// 银狼
	const 银狼加成 = { 减抗: 10 + 3, 减防百分比: 45 + 8 };
	const 银狼植入弱点加成 = { 减抗: 10 + 20 + 3, 减防百分比: 45 + 8 };
	const 银狼加成下伤害期望 = 计算伤害({
		...单人数值,
		减防百分比: 单人数值.减防百分比 + 银狼加成.减防百分比,
		减抗: 单人数值.减抗 + 银狼加成.减抗,
	});
	const 银狼植入弱点加成下伤害期望 = 计算伤害({
		...单人数值,
		减防百分比: 单人数值.减防百分比 + 银狼植入弱点加成.减防百分比,
		减抗: 单人数值.减抗 + 银狼植入弱点加成.减抗,
	});

	// 布洛妮娅
	const 假设布洛妮娅暴击伤害 = 150;
	const 布洛妮娅加成 = {
		伤害提高: 66 + 10,
		面板攻击力: 基础攻击力 * 0.55,
		暴击伤害: 20 + 假设布洛妮娅暴击伤害 * 0.16,
	};
	const 布洛妮娅加成下伤害期望 = 计算伤害({
		...单人数值,
		伤害提高: 单人数值.伤害提高 + 布洛妮娅加成.伤害提高,
		面板攻击力: 单人数值.面板攻击力 + 布洛妮娅加成.面板攻击力,
		暴击伤害: 单人数值.暴击伤害 + 布洛妮娅加成.暴击伤害,
	});

	// 停云
	const 停云加成 = {
		伤害提高: 50,
		面板攻击力: 基础攻击力 * 0.5,
		技能倍率: 20,
	};
	const 停云加成下伤害期望 = 计算伤害({
		...单人数值,
		伤害提高: 单人数值.伤害提高 + 停云加成.伤害提高,
		面板攻击力: 单人数值.面板攻击力 + 停云加成.面板攻击力,
	});
	const 停云输出角色为雷属性加成下伤害期望 = 计算伤害({
		...单人数值,
		伤害提高: 单人数值.伤害提高 + 停云加成.伤害提高,
		面板攻击力: 单人数值.面板攻击力 + 停云加成.面板攻击力,
		技能倍率: 单人数值.技能倍率 + 停云加成.技能倍率,
	});

	// 艾斯妲
	const 艾斯妲加成 = {
		速度: 50,
		面板攻击力: 基础攻击力 * 0.7,
		伤害提高: 18,
	};
	const 艾斯妲加成下伤害期望 = 计算伤害({
		...单人数值,
		面板攻击力: 单人数值.面板攻击力 + 艾斯妲加成.面板攻击力,
		速度: 单人数值.速度 + 艾斯妲加成.速度,
	});
	const 艾斯妲输出角色为火属性加成下伤害期望 = 计算伤害({
		...单人数值,
		伤害提高: 单人数值.伤害提高 + 艾斯妲加成.伤害提高,
		面板攻击力: 单人数值.面板攻击力 + 艾斯妲加成.面板攻击力,
		速度: 单人数值.速度 + 艾斯妲加成.速度,
	});

	// 驭空
	const 驭空加成 = {
		面板攻击力: 基础攻击力 * 0.8,
		暴击率: 28,
		暴击伤害: 65,
		伤害提高: 12,
	};
	const 驭空加成下伤害期望 = 计算伤害({
		...单人数值,
		面板攻击力: 单人数值.面板攻击力 + 驭空加成.面板攻击力,
		暴击率: 单人数值.暴击率 + 驭空加成.暴击率,
		暴击伤害: 单人数值.暴击伤害 + 驭空加成.暴击伤害,
	});
	const 驭空输出角色为虚数属性加成下伤害期望 = 计算伤害({
		...单人数值,
		伤害提高: 单人数值.伤害提高 + 驭空加成.伤害提高,
		面板攻击力: 单人数值.面板攻击力 + 驭空加成.面板攻击力,
		暴击率: 单人数值.暴击率 + 驭空加成.暴击率,
		暴击伤害: 单人数值.暴击伤害 + 驭空加成.暴击伤害,
	});

	return (
		<>
			<h2>面板数值</h2>
			<h4>攻击力乘区</h4>
			<div>
				<div>
					面板攻击力
					<input type="number" onChange={(e) => 设置面板攻击力(+e.target.value)} value={面板攻击力}></input>
					&nbsp;&nbsp;&nbsp;(基础攻击力
					<input type="number" onChange={(e) => 设置基础攻击力(+e.target.value)} value={基础攻击力}></input>)
				</div>
			</div>
			<h4>增伤乘区</h4>
			<div>
				伤害提高
				<input type="number" onChange={(e) => 设置伤害提高(+e.target.value)} value={伤害提高}></input> %
			</div>
			<h4>暴击乘区</h4>
			<div>
				<div>
					暴击率
					<input type="number" onChange={(e) => 设置暴击率(+e.target.value)} value={暴击率}></input> %
					&nbsp;&nbsp;&nbsp;暴击伤害
					<input type="number" onChange={(e) => 设置暴击伤害(+e.target.value)} value={暴击伤害}></input> %
				</div>
			</div>
			<h4>防御力乘区</h4>
			<div>
				<div>
					人物等级
					<input type="number" onChange={(e) => 设置人物等级(+e.target.value)} value={人物等级}></input>
					&nbsp;&nbsp;&nbsp;怪物等级
					<input type="number" onChange={(e) => 设置怪物等级(+e.target.value)} value={怪物等级}></input>
					&nbsp;&nbsp;&nbsp;减防百分比
					<input type="number" onChange={(e) => 设置减防百分比(+e.target.value)} value={减防百分比}></input> %
				</div>
			</div>
			<h4>抗性乘区</h4>
			<div>
				<div>
					怪物抗性
					<input type="number" onChange={(e) => 设置怪物抗性(+e.target.value)} value={怪物抗性}></input> %
					&nbsp;&nbsp;&nbsp;减抗
					<input type="number" onChange={(e) => 设置减抗(+e.target.value)} value={减抗}></input> %
				</div>
			</div>
			<h4>易伤乘区</h4>
			<div>
				<div>
					易伤
					<input type="number" onChange={(e) => 设置易伤(+e.target.value)} value={易伤}></input> %
				</div>
			</div>
			<h4>韧性乘区</h4>
			<div>
				<div>
					韧性减伤
					<input type="number" onChange={(e) => 设置韧性减伤(+e.target.value)} value={韧性减伤}></input> %
				</div>
			</div>
			<h4>速度乘区</h4>
			<div>
				速度
				<input type="number" onChange={(e) => 设置速度(+e.target.value)} value={速度}></input>
			</div>
			<h4>倍率乘区</h4>
			<div>
				技能倍率
				<input type="number" onChange={(e) => 设置技能倍率(+e.target.value)} value={技能倍率}></input>%
			</div>

			<h3>单人伤害</h3>
			<div>单段伤害期待：{单人伤害.暴击伤害期望.toFixed(2)}</div>
			<div>单段暴击大数字：{单人伤害.暴击时伤害.toFixed(2)}</div>
			<div>理论轮均伤害：{单人伤害.轮均期待伤害.toFixed(2)}</div>

			<h3>辅助加成比例</h3>
			<h4>银狼加成</h4>
			<p>10级战技-10%抗性，10级终结技-45%防御力，10级天赋-8%防御力，额外能力3触发-3%抗性</p>
			<p>
				未植入新弱点：单段伤害期望 {银狼加成下伤害期望.暴击伤害期望.toFixed(2)}, 提升
				{计算提升(银狼加成下伤害期望.暴击伤害期望, 单人伤害.暴击伤害期望)}%
			</p>
			<p>
				植入新弱点-20%抗性：单段伤害期望 {银狼植入弱点加成下伤害期望.暴击伤害期望.toFixed(2)}, 提升
				{计算提升(银狼植入弱点加成下伤害期望.暴击伤害期望, 单人伤害.暴击伤害期望)}%
			</p>
			<h4>布洛妮娅加成</h4>
			<p>
				10级战技+66%增伤，10级终结技+55%攻击力+20%爆伤+16%布洛妮娅的爆伤，难民布洛妮娅150%爆伤，额外能力3
				+10%增伤
			</p>
			<p>
				不记战技拉条的伤害提升：单段伤害期望 {布洛妮娅加成下伤害期望.暴击伤害期望.toFixed(2)}, 提升
				{计算提升(布洛妮娅加成下伤害期望.暴击伤害期望, 单人伤害.暴击伤害期望)}%
			</p>

			<h4>停云加成</h4>
			<p>10级战技+50%攻击力并额外造成20%攻击的额外伤害（20%倍率，会被技能倍率稀释），10级终结技+50%增伤</p>
			<p>
				不计算额外伤害的伤害提升：单段伤害期望 {停云加成下伤害期望.暴击伤害期望.toFixed(2)}, 提升
				{计算提升(停云加成下伤害期望.暴击伤害期望, 单人伤害.暴击伤害期望)}%
			</p>
			<p>
				输出为雷属性时计算额外伤害的伤害提升：单段伤害期望{' '}
				{停云输出角色为雷属性加成下伤害期望.暴击伤害期望.toFixed(2)}, 提升
				{计算提升(停云输出角色为雷属性加成下伤害期望.暴击伤害期望, 单人伤害.暴击伤害期望)}%
			</p>
			<h4>艾斯妲加成</h4>
			<p>10级天赋满层+70%攻击力，10级终结技+50速度，额外能力2 +18%火属性伤害</p>
			<p>
				满层时非火系输出的伤害提升：单段伤害期望 {艾斯妲加成下伤害期望.暴击伤害期望.toFixed(2)}, 提升
				{计算提升(艾斯妲加成下伤害期望.暴击伤害期望, 单人伤害.暴击伤害期望)}%
			</p>
			<p>
				轮均伤害提升：轮均期待伤害 {艾斯妲加成下伤害期望.轮均期待伤害.toFixed(2)}, 提升
				{计算提升(艾斯妲加成下伤害期望.轮均期待伤害, 单人伤害.轮均期待伤害)}%
			</p>
			<p>
				满层时火系输出的伤害提升：单段伤害期望 {艾斯妲输出角色为火属性加成下伤害期望.暴击伤害期望.toFixed(2)},
				提升
				{计算提升(艾斯妲输出角色为火属性加成下伤害期望.暴击伤害期望, 单人伤害.暴击伤害期望)}%
			</p>
			<p>
				轮均伤害提升：轮均期待伤害 {艾斯妲输出角色为火属性加成下伤害期望.轮均期待伤害.toFixed(2)}, 提升
				{计算提升(艾斯妲输出角色为火属性加成下伤害期望.轮均期待伤害, 单人伤害.轮均期待伤害)}%
			</p>
			<h4>驭空加成</h4>
			<p>10级战技+80%攻击力，10级终结技+28%暴击率+65%暴击伤害，额外能力2 +12%虚数伤害</p>
			<p>
				非虚数系输出的伤害提升：单段伤害期望 {驭空加成下伤害期望.暴击伤害期望.toFixed(2)}, 提升
				{计算提升(驭空加成下伤害期望.暴击伤害期望, 单人伤害.暴击伤害期望)}%
			</p>
			<p>
				虚数系输出的伤害提升：单段伤害期望 {驭空输出角色为虚数属性加成下伤害期望.暴击伤害期望.toFixed(2)}, 提升
				{计算提升(驭空输出角色为虚数属性加成下伤害期望.暴击伤害期望, 单人伤害.暴击伤害期望)}%
			</p>
			<三月七 />
		</>
	);
}
